# Extract and Transform a kaggle database

### Customer Shopping Trends Dataset

https://www.kaggle.com/discussions/general/124517


It is a mock dataset, I will artificially consider this is the sales record of the items available in Amazon and ASOS

### 0. Import modules

In [17]:
import pandas as pd
import numpy as np
import warnings
import random
warnings.filterwarnings('ignore') # ignorar warnings

# Import my module
from src import dataanalysis_fun1 as mlg

In [2]:
kaggle_raw = pd.read_csv('../../data/raw/shopping_trends_updated.csv')

In [3]:
kaggle_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3900 entries, 0 to 3899
Data columns (total 18 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Customer ID             3900 non-null   int64
 1   Age                     3900 non-null   int64
 2   Gender                  3900 non-null   object
 3   Item Purchased          3900 non-null   object
 4   Category                3900 non-null   object
 5   Purchase Amount (USD)   3900 non-null   int64
 6   Location                3900 non-null   object
 7   Size                    3900 non-null   object
 8   Color                   3900 non-null   object
 9   Season                  3900 non-null   object
 10  Review Rating           3900 non-null   float64
 11  Subscription Status     3900 non-null   object
 12  Shipping Type           3900 non-null   object
 13  Discount Applied        3900 non-null   object
 14  Promo Code Used         3900 non-null   object
 15  Previous Purchases      3900 non-null   int64
 16  Payment Method          3900 non-null   object
 17  Frequency of Purchases  3900 non-null   object
dtypes: float64(1), int64(4), object(13)
memory usage: 548.6+ KB

In [8]:
kaggle_raw.columns

Index(['Customer ID', 'Age', 'Gender', 'Item Purchased', 'Category',
       'Purchase Amount (USD)', 'Location', 'Size', 'Color', 'Season',
       'Review Rating', 'Subscription Status', 'Shipping Type',
       'Discount Applied', 'Promo Code Used', 'Previous Purchases',
       'Payment Method', 'Frequency of Purchases'],
      dtype='object')

In [11]:
kaggle_raw1=kaggle_raw[["Customer ID", "Age", "Gender", "Location", "Payment Method", "Review Rating", "Season"]]

### normalize column names

In [24]:
kaggle_raw1=mlg.colnnam_clean(kaggle_raw1)
kaggle_raw1.head()

,customer_id,age,gender,location,payment_method,review_rating,season
0,1,55,Male,Kentucky,Venmo,3.1,Winter
1,2,19,Male,Maine,Cash,3.1,Winter
2,3,50,Male,Massachusetts,Credit Card,3.1,Spring
3,4,21,Male,Rhode Island,PayPal,3.5,Spring
4,5,45,Male,Oregon,PayPal,2.7,Spring

### Assign random Spanish province names to the customers

In [26]:
spanish_prov = [
    'Álava', 'Albacete', 'Alicante', 'Almería', 'Asturias', 'Ávila', 'Badajoz',
    'Barcelona', 'Burgos', 'Cáceres', 'Cádiz', 'Cantabria', 'Castellón',
    'Ciudad Real', 'Córdoba', 'Cuenca', 'Gerona', 'Granada', 'Guadalajara',
    'Gipuzkoa', 'Huelva', 'Huesca', 'Baleares', 'Jaén',
    'La Coruña', 'La Rioja', 'Las Palmas', 'León', 'Lleida', 'Lugo',
    'Madrid', 'Málaga', 'Murcia', 'Navarra', 'Orense', 'Palencia',
    'Pontevedra', 'Salamanca', 'Santa Cruz de Tenerife', 'Segovia', 'Sevilla',
    'Soria', 'Tarragona', 'Teruel', 'Toledo', 'Valencia', 'Valladolid',
    'Bizkaia', 'Zamora', 'Zaragoza'
]
spanish_prov=mlg.namvector_clean(spanish_prov)

In [29]:
for i in range(len(kaggle_raw1)):
    kaggle_raw1.location[i]=random.choice(spanish_prov)

In [33]:
kaggle_raw1

,customer_id,age,gender,location,payment_method,review_rating,season
0,1,55,Male,teruel,Venmo,3.1,Winter
1,2,19,Male,cadiz,Cash,3.1,Winter
2,3,50,Male,barcelona,Credit Card,3.1,Spring
3,4,21,Male,ciudad_real,PayPal,3.5,Spring
4,5,45,Male,alava,PayPal,2.7,Spring
...,...,...,...,...,...,...,...
3895,3896,40,Female,navarra,Venmo,4.2,Summer
3896,3897,52,Female,albacete,Bank Transfer,4.5,Spring
3897,3898,46,Female,palencia,Venmo,2.9,Spring
3898,3899,44,Female,salamanca,Venmo,3.8,Summer
3899,3900,52,Female,barcelona,Venmo,3.1,Spring

In [34]:
kaggle_clean=kaggle_raw1.copy()
#kaggle_clean.to_csv('../../data/clean/kaggle_clean.csv', index=False)